package homeWork18;

public class HomeWork18 {
    public static void main(String[] args) {
        String[][][] bigArray = {
                {{"1", "2", "3", "0"}, {"4", "5", "6", "0"}, {"7", "8", "9", "0"}, {"0", "1", "0", "1"}},
                {{"a", "b", "c", "d"}, {"e", "f", "g", "h"}, {"i", "j", "k", "l"}, {"m", "n", "o", "p"}},
                {{"1.2", "22", "33", "00"}, {"44", "55", "66", "00"}, {"77", "88", "99", "00"}, {"00", "11", "0.0", "1"}},
                {{"1", "2", "3", "0"}, {"4", "5", "6", "0"}, {"7", "8", "9", "0"}}};
        MyArray myArr = new MyArray(bigArray[3]);
        // Мне казалось что наоборот нужно что бы считались и дробные числа, поэтому возвращает double
        System.out.println(myArr.myArraySum());
    }
}
